; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v10 ?v6)
             (pred_2 ?v12 ?v9)
             (pred_9 ?v10 ?v9)
             (pred_3 ?v8 ?v10 )
	     (pred_6 ?v10)
             (pred_7 ?v7)
             (pred_1 ?v12)
             (pred_11 ?v9)
             (pred_10 ?v10)
             (pred_5 ?v12)
             (pred_12 ?v10)
             (pred_4 ))



(:action op_3
:parameters (?v1 ?v5 ?v2 ?v4)
:precondition (and (pred_7 ?v1) (pred_7 ?v5) (pred_1 ?v2) (pred_11 ?v4)
          (pred_8 ?v1 ?v5) (pred_2 ?v2 ?v4)
                   (pred_9 ?v5 ?v4) (pred_6 ?v1) 
                   (pred_10 ?v5) (pred_5 ?v2))
:effect (and  (pred_12 ?v5) (not (pred_10 ?v5))))


(:action op_4
:parameters (?v1 ?v11)
:precondition (and (pred_7 ?v1) (pred_7 ?v11)
               (pred_6 ?v1) (pred_8 ?v1 ?v11) (pred_12 ?v11))
:effect (and (pred_6 ?v11) (not (pred_6 ?v1))))

(:action op_2
:parameters (?v1 ?v2)
:precondition (and (pred_7 ?v1) (pred_1 ?v2) 
                  (pred_6 ?v1) (pred_3 ?v2 ?v1) (pred_4 ))
:effect (and (pred_5 ?v2)
   (not (pred_3 ?v2 ?v1)) (not (pred_4 ))))


(:action op_1
:parameters (?v1 ?v13 ?v3)
:precondition (and (pred_7 ?v1) (pred_1 ?v13) (pred_1 ?v3)
                  (pred_6 ?v1) (pred_5 ?v3) (pred_3 ?v13 ?v1))
:effect (and (pred_5 ?v13) (pred_3 ?v3 ?v1)
        (not (pred_5 ?v3)) (not (pred_3 ?v13 ?v1))))

(:action op_5
:parameters (?v1 ?v2)
:precondition (and (pred_7 ?v1) (pred_1 ?v2) 
                  (pred_6 ?v1) (pred_5 ?v2))
:effect (and (pred_4 ) (pred_3 ?v2 ?v1) (not (pred_5 ?v2)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_13 obj_17 obj_19 obj_16 obj_04 obj_02 obj_12 obj_06 obj_03 obj_20 obj_10 obj_15 obj_21 obj_18 obj_07
    obj_01 obj_09 obj_22
    obj_11 obj_14 obj_05
    )

    (:init
       (pred_4)

       (pred_7 obj_08)
       (pred_7 obj_13)
       (pred_7 obj_17)
       (pred_7 obj_19)
       (pred_7 obj_16)
       (pred_7 obj_04)
       (pred_7 obj_02)
       (pred_7 obj_12)
       (pred_7 obj_06)
       (pred_7 obj_03)
       (pred_7 obj_20)
       (pred_7 obj_10)
       (pred_7 obj_15)
       (pred_7 obj_21)
       (pred_7 obj_18)
       (pred_7 obj_07)
       (pred_11 obj_01)
       (pred_11 obj_09)
       (pred_11 obj_22)
       (pred_1 obj_11)
       (pred_1 obj_14)
       (pred_1 obj_05)

       (pred_8 obj_08 obj_16)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_13 obj_04)
       (pred_8 obj_13 obj_17)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_17 obj_02)
       (pred_8 obj_17 obj_19)
       (pred_8 obj_17 obj_13)
       (pred_8 obj_19 obj_12)
       (pred_8 obj_19 obj_17)
       (pred_8 obj_16 obj_06)
       (pred_8 obj_16 obj_04)
       (pred_8 obj_16 obj_08)
       (pred_8 obj_04 obj_03)
       (pred_8 obj_04 obj_02)
       (pred_8 obj_04 obj_13)
       (pred_8 obj_04 obj_16)
       (pred_8 obj_02 obj_20)
       (pred_8 obj_02 obj_12)
       (pred_8 obj_02 obj_17)
       (pred_8 obj_02 obj_04)
       (pred_8 obj_12 obj_10)
       (pred_8 obj_12 obj_19)
       (pred_8 obj_12 obj_02)
       (pred_8 obj_06 obj_15)
       (pred_8 obj_06 obj_03)
       (pred_8 obj_06 obj_16)
       (pred_8 obj_03 obj_21)
       (pred_8 obj_03 obj_20)
       (pred_8 obj_03 obj_04)
       (pred_8 obj_03 obj_06)
       (pred_8 obj_20 obj_18)
       (pred_8 obj_20 obj_10)
       (pred_8 obj_20 obj_02)
       (pred_8 obj_20 obj_03)
       (pred_8 obj_10 obj_07)
       (pred_8 obj_10 obj_12)
       (pred_8 obj_10 obj_20)
       (pred_8 obj_15 obj_21)
       (pred_8 obj_15 obj_06)
       (pred_8 obj_21 obj_18)
       (pred_8 obj_21 obj_03)
       (pred_8 obj_21 obj_15)
       (pred_8 obj_18 obj_07)
       (pred_8 obj_18 obj_20)
       (pred_8 obj_18 obj_21)
       (pred_8 obj_07 obj_10)
       (pred_8 obj_07 obj_18)
       (pred_10 obj_07)
       (pred_10 obj_12)
       (pred_10 obj_10)
       (pred_9  obj_07 obj_01)
       (pred_9  obj_12 obj_09)
       (pred_9  obj_10 obj_22)
       (pred_12 obj_08)
       (pred_12 obj_13)
       (pred_12 obj_17)
       (pred_12 obj_19)
       (pred_12 obj_16)
       (pred_12 obj_04)
       (pred_12 obj_02)
       (pred_12 obj_06)
       (pred_12 obj_03)
       (pred_12 obj_20)
       (pred_12 obj_15)
       (pred_12 obj_21)
       (pred_12 obj_18)

       (pred_2  obj_11 obj_01)
       (pred_2  obj_14 obj_09)
       (pred_2  obj_05 obj_22)
       (pred_3 obj_11 obj_16)
       (pred_3 obj_14 obj_08)
       (pred_3 obj_05 obj_02)
       (pred_6 obj_15)
    )

    (:goal (and
       (pred_3 obj_14 obj_03)
    ))
(:constraints
  (always (not (pred_6 obj_04)))
)
)

; plan
1. (op_4 obj_15 obj_06)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_06)
   goals met: 0 of 1
2. (op_4 obj_06 obj_16)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_16)
   goals met: 0 of 1
3. (op_4 obj_16 obj_08)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_08)
   goals met: 0 of 1
4. (op_2 obj_08 obj_14)
   deleted: (pred_3 obj_14 obj_08) (pred_4)
   added: (pred_5 obj_14)
   goals met: 0 of 1
5. (op_4 obj_08 obj_16)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_16)
   goals met: 0 of 1
6. (op_4 obj_16 obj_06)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_06)
   goals met: 0 of 1
7. (op_4 obj_06 obj_03)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_03)
   goals met: 0 of 1
8. (op_5 obj_03 obj_14)
   deleted: (pred_5 obj_14)
   added: (pred_4) (pred_3 obj_14 obj_03)
   goals met: 1 of 1
